UPDATE product SET description =
        'Корпус смартфона Xiaomi выполнен в оригинальном цвете и изготавливается из пластика.
        Возможна одновременная установка 2 SIM-карт формата Nano-SIM, которые поддерживают модули связи для сетей 2G, 3G,
        4G (LTE). Широкий экран разрешением 2340x1080 лишен рамок и оснащен защитным покрытием Corning Gorilla Glass 3,
        которое препятствует появлению царапин. Дисплей может передавать до 16.7 различных цветов. Установленная ОС – Android 10.
        Смартфон Xiaomi обладает высокой скоростью работы и хорошей продуктивностью благодаря мощному 8-ядерному процессору
        MediaTek Helio G80 с частотой 2 и 1.8 ГГц. 4 ГБ памяти RAM позволяют обрабатывать данные о нескольких программах сразу.
        Для хранения личных файлов предназначено хранилище на 64 ГБ. Модули беспроводной связи представлены BT 5.0, Wi-Fi, GPS.
        Для бесконтактной оплаты есть NFC и Google Pay. Безопасность данных обеспечивается сканером лица и отпечатка пальца.
        Емкая батарея 5020 мА*ч поддерживает опцию быстрой зарядки.'
WHERE category_id = '1';

UPDATE product SET description =
        'iPad идеально сочетает в себе компактность и производительность — за это его и любят. Теперь для любви
        появилось ещё больше поводов. Процессор A12 Bionic с системой Neural Engine. Дисплей Retina 7,9 дюйма с
        технологией True Tone. И поддержка Apple Pencil, чтобы вам было ещё проще следовать за вдохновением.
        Это всё тот же iPad mini, но теперь он умеет больше.
        iPad невероятно компактный и лёгкий, поэтому без труда составит вам компанию, где бы вы ни находились.
        Он весит меньше 400 г при толщине 6,1 мм и прекрасно помещается в карман или сумку. Его очень удобно держать в
        руке и можно быстро достать из кармана, когда этого потребует вдохновение. iPad оснащён великолепным дисплеем
        7,9 дюйма, который отображает более 3 миллионов пикселей. И мы извлекли максимум из каждого. Высокая яркость,
        широкий цветовой охват и антибликовое покрытие позволяют использовать iPad в любых условиях. Неважно, что вы
        делаете: читаете книгу в парке или монтируете видео дома — изображение и текст всегда будут выглядеть
        максимально чётко и естественно. А технология True Tone автоматически настраивает баланс белого с учётом
        освещения, поэтому теперь цвета будут смотреться ещё натуральнее.'
WHERE category_id = '2';

UPDATE product SET description =
        'Классический компактный дизайн, мощный процессор и масса других достоинств. iPhone создан, чтобы стать вашим
        идеальным смартфоном. iPhone защищён от воды и может выдержать погружение на глубину до 1 метра в течение 30
        минут. Если вы прольёте на него немного кофе, чая или газировки, он будет в порядке. И пыль ему тоже не страшна.
        На iPhone вы сможете смотреть видео до 13 часов без подзарядки. А когда придёт время зарядить телефон, просто
        положите его на устройство для беспроводной зарядки. Или воспользуйтесь функцией быстрой зарядки, подключив
        iPhone к адаптеру 18 Вт, — телефон зарядится с нуля до 50% за 30 минут. iPhone создан для работы с самыми
        передовыми технологиями. Даже с теми, которые ещё не изобретены. Включайте тёмный режим, пользуйтесь быстрыми
        командами Siri и приложением «Фото». Кроме того, вам будут доступны все системные обновления, улучшающие работу
        отдельных функций и повышающие безопасность.'
WHERE category_id = '3';